In [13]:
import pandas as pd
import numpy as np

In [14]:
#Q.1
s_series = pd.Series([10,20,30,40])
print(s_series)

0    10
1    20
2    30
3    40
dtype: int64

In [15]:
#Q.2
s_series=pd.Series([10,20,30,40,50])
list = s_series.tolist()
print("List is",list)
print("Its Type=",{type(list)})

List is [10, 20, 30, 40, 50]
Its Type= {<class 'list'>}

In [16]:
array1=pd.Series([2, 4, 6, 8, 10])
array2=pd.Series([1, 3, 5, 7, 9])

add= array1+array2
print("Addition",add)
sub= array1-array2
print("Subtraction",sub)
mul= array1*array2
print("Multiplication",mul)
div= array1/array2
print("Division",div)

Addition 0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtraction 0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiplication 0     2
1    12
2    30
3    56
4    90
dtype: int64
Division 0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [17]:
#Q.4 
Dict = {'A':10,'B':20,'C':30,'D':40}
P_series = pd.Series(Dict)
print(P_series)

A    10
B    20
C    30
D    40
dtype: int64

In [18]:
#Q.5
np_array = np.array([10,20,30,40])
series = pd.Series(np_array)
print(series)

0    10
1    20
2    30
3    40
dtype: int64

In [19]:
series = pd.Series([1,2,3,4,5])
print(series.tolist())

[1, 2, 3, 4, 5]

In [20]:
#Q7
series=pd.Series([1,2,3,4,5])
print(series.values)

[1 2 3 4 5]

In [21]:
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']}
df = pd.DataFrame(data)
print("DataFrame created from the dictionary:")
print(df)

DataFrame created from the dictionary:
      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [22]:
#Q.9
n1 = [1,2,3,4,5,6,7,8,9,10]
n2 = ["Vishal","Sumit","Mayur","Swapnil","Arun","Chirag","Hemanshu","Radhika","Ashish","Hitul"]
s1 = pd.Series(n1,name="emp_id")
s2 = pd.Series(n2,name="names")
df3 = pd.concat([s1,s2],axis=1)
print(df3)
print("")
print(df3.head(5))
print("")
print(df3.tail(5))
print("")
print(df3.head(2))
print("")
print(df3.tail(2))
print("")
print(f"Name of the 5th employpee: {df3.iloc[4]['names']}")
print("")
print("Record of the 4th employpee:")
print(df3.iloc[3])

df3.to_csv('MyRecord.csv')

   emp_id     names
0       1    Vishal
1       2     Sumit
2       3     Mayur
3       4   Swapnil
4       5      Arun
5       6    Chirag
6       7  Hemanshu
7       8   Radhika
8       9    Ashish
9      10     Hitul

   emp_id    names
0       1   Vishal
1       2    Sumit
2       3    Mayur
3       4  Swapnil
4       5     Arun

   emp_id     names
5       6    Chirag
6       7  Hemanshu
7       8   Radhika
8       9    Ashish
9      10     Hitul

   emp_id   names
0       1  Vishal
1       2   Sumit

   emp_id   names
8       9  Ashish
9      10   Hitul

Name of the 5th employpee: Arun

Record of the 4th employpee:
emp_id          4
names     Swapnil
Name: 3, dtype: object

In [23]:
#Q.10
df4 = pd.read_csv('MyRecord.csv')
df4['Salary'] = [25000,35000,31000,85000,36000,63000,52000,50000,91000,40000]
df4.to_csv('MyRecord.csv')

In [25]:
df = pd.read_csv('./Advertising.csv')

In [26]:
df.head(5)

      TV  radio  newspaper  sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

In [27]:
df.tail(5)

        TV  radio  newspaper  sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [28]:
df.columns

Index(['TV', 'radio', 'newspaper', 'sales'], dtype='object')

In [29]:
df.tail(3)

        TV  radio  newspaper  sales
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   radio      200 non-null    float64
 2   newspaper  200 non-null    float64
 3   sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [31]:
df.dtypes

TV           float64
radio        float64
newspaper    float64
sales        float64
dtype: object

In [33]:
df.isna().sum()

TV           0
radio        0
newspaper    0
sales        0
dtype: int64

In [36]:
df1=df.drop('radio',axis=1)
df1.head(10)

      TV  newspaper  sales
0  230.1       69.2   22.1
1   44.5       45.1   10.4
2   17.2       69.3    9.3
3  151.5       58.5   18.5
4  180.8       58.4   12.9
5    8.7       75.0    7.2
6   57.5       23.5   11.8
7  120.2       11.6   13.2
8    8.6        1.0    4.8
9  199.8       21.2   10.6

In [38]:
df['updated_sales'] = df['sales'] *1.1

In [39]:
df.head()

      TV  radio  newspaper  sales  updated_sales
0  230.1   37.8       69.2   22.1          24.31
1   44.5   39.3       45.1   10.4          11.44
2   17.2   45.9       69.3    9.3          10.23
3  151.5   41.3       58.5   18.5          20.35
4  180.8   10.8       58.4   12.9          14.19

In [43]:
df.shape

(200, 5)

In [44]:
df.describe

<bound method NDFrame.describe of         TV  radio  newspaper  sales  updated_sales
0    230.1   37.8       69.2   22.1          24.31
1     44.5   39.3       45.1   10.4          11.44
2     17.2   45.9       69.3    9.3          10.23
3    151.5   41.3       58.5   18.5          20.35
4    180.8   10.8       58.4   12.9          14.19
..     ...    ...        ...    ...            ...
195   38.2    3.7       13.8    7.6           8.36
196   94.2    4.9        8.1    9.7          10.67
197  177.0    9.3        6.4   12.8          14.08
198  283.6   42.0       66.2   25.5          28.05
199  232.1    8.6        8.7   13.4          14.74

[200 rows x 5 columns]>

In [45]:
df.describe()

               TV       radio   newspaper       sales  updated_sales
count  200.000000  200.000000  200.000000  200.000000     200.000000
mean   147.042500   23.264000   30.554000   14.022500      15.424750
std     85.854236   14.846809   21.778621    5.217457       5.739202
min      0.700000    0.000000    0.300000    1.600000       1.760000
25%     74.375000    9.975000   12.750000   10.375000      11.412500
50%    149.750000   22.900000   25.750000   12.900000      14.190000
75%    218.825000   36.525000   45.100000   17.400000      19.140000
max    296.400000   49.600000  114.000000   27.000000      29.700000

In [46]:
df= pd.read_csv('./Salary_Data.csv')

In [49]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [50]:
df.head(10)

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891
5              2.9   56642
6              3.0   60150
7              3.2   54445
8              3.2   64445
9              3.7   57189

In [51]:
df.tail()

    YearsExperience  Salary
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [52]:
df.tail(10)

    YearsExperience  Salary
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [53]:
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [54]:
df.shape

(33, 2)

In [58]:
df.describe()

       YearsExperience         Salary
count        33.000000      33.000000
mean          5.921212   82760.303030
std           3.342413   34014.620992
min           1.100000   37731.000000
25%           3.200000   56957.000000
50%           5.100000   67938.000000
75%           8.700000  109431.000000
max          13.000000  156000.000000

In [59]:
df.describe

<bound method NDFrame.describe of     YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000>

In [60]:
df.dtypes

YearsExperience    float64
Salary               int64
dtype: object

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  33 non-null     float64
 1   Salary           33 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 656.0 bytes